
"_BASE_USED_" = "en";
/* Use the _ADVANCED_EXTRA_WIDTH_ (if needed) to fit the method description properly */
"_ADVANCED_EXTRA_WIDTH_" = "0.0";
/* Use the _PREFERENCES_EXTRA_WIDTH_ (if needed) to fit the action to perform description properly */
"_PREFERENCES_EXTRA_WIDTH_" = "0.0";
"General" = "Chung";
"File Access" = "Quyền truy cập tập tin";
"Performance" = "Hiệu suất";
"Finder Extension" = "Phần mở rộng Finder";
"Love" = "Love";
"OK" = "OK";
"Done" = "Hoàn thành";
"Yes" = "Có";
"No" = "Không";
"Don't show again" = "Không hiện lại nữa";
"Set as default compressor" = "Đặt làm trình giải nén mặt định";
"Not now" = "Không phải lúc này";
"Want to make Keka your default compressor?" = "Bạn có muốn đặt Keka làm trình giải nén mặc định chứ?";
"This means that all the compatible files will be extracted with Keka by now. You can set this later in the Keka Preferences." = "Điều này có nghĩa là tất cả tập tin tương thích với Keka sẽ được Keka xử lý. Bạn có thể thiết lập sau trong phần Cài đặt của Keka.";
"Really want to close Keka?" = "Bạn muốn đóng Keka?";
"The current operations will be canceled. If you choose to wait and quit Keka will exit when all work is done." = "Thao tác đang thực hiện sẽ bị huỷ bỏ. Nếu bạn chọn đợi và thoát, Keka sẽ tự đóng khi tất cả thao tác hoàn thành.";
"Password needed" = "Yêu cầu mật khẩu";
"File \"%@\" needs a password to be extracted" = "Tập tin \"%@\" cần một mật khẩu để giải nén";
"File \"%@\" needs a special encoding to be extracted" = "Tập tin \"%@\" cần một mã hoá đặt biệt để giải nén";
"Extraction of \"%@\" done" = "Giải nén cho \"%@\" hoàn thành";
"Extraction of \"%@\" failed." = "Giải nén cho \"%@\" thất bại.";
"Extraction of %i files done" = "Giải nén được %i tập tin hoàn thành";
"Extraction complete" = "Giải nén hoàn tất";
"Extraction fail" = "Giải nén thất bại";
"Compression complete" = "Nén hoàn tất";
"File \"%@\" created" = "Tập tin \"%@\" đã được tạo";
"Compression fail" = "Nén thất bại";
"File \"%@\" cannot be created" = "Tập tin \"%@\" không thể tạo được";
"\n(using fallback folder)" = "\n(sử dụng thư mục dự phòng)";
"Operation not implemented" = "Thao tác chưa được thực hiện";
"Performing operation..." = "Đang thực hiện thao tác...";
"Waiting..." = "Đang đợi...";
"Extracting \"%@\"" = "Đang giải nén \"%@\"";
"Extracting \"%@...\"" = "Đang giải nén \"%@...\"";
"Creating %@ file..." = "Đang tạo %@ tập tin...";
"Creating file \"%@\"" = "Đang tạo tập tin \"%@\"";
"Creating file \"%@...\"" = "Đang tạo tập tin \"%@...\"";
"Volume name:" = "Tên phân vùng:";
"Select the encoding for \"%@\"" = "Chọn mã hoá cho \"%@\"";
"Time elapsed: %d:%@%d:%@%d hours%@" = "Thời gian thực thi: %d:%@%d:%@%d tiếng%@";
"Time elapsed: %d:%@%d minutes%@" = "Thời gian thực thi: %d:%@%d phút%@";
"Time elapsed: %d seconds%@" = "Thời gian thực thi: %d giây%@";
"%.0f seconds" = "%.0f giây";
"%i:%02i minutes" = "%i:%02i giây";
"%i:%02i:%02i hours" = "%i:%02i:%02i tiếng";
"Pause" = "Tạm dừng";
"Continue" = "Tiếp tục";
"Operation paused" = "Thao tác tạm dừng";
"Cancel" = "Huỷ bỏ";
"Close" = "Đóng";
"Operation failed" = "Thao tác thất bại";
"Operation failed with error code %d" = "Thao tác thất bại với mã lỗi %d";
"Choose a name and folder to start the compression" = "Chọn một tên và thư mục để bắt đầu lệnh nén";
"Creation of \"%@\" failed" = "Tạo ra \"%@\" thất bại";
"Creating \"%@\"" = "Đang tạo \"%@\"";
"Preparing extraction..." = "Chuẩn bị giải nén…";
"Choose a folder to extract this file" = "Chọn một thư mục để giải nén tập tin này";
"Choose where do you want to extract \"%@\"" = "Chọn nơi bạn muốn giải nén \"%@\"";
"Select all the volumes from \"%@\" or the folder that contains them" = "Chọn tất cả phân vùng từ \"%@\" hoặc thư mục mà nó chứa chúng";
"Select the folder that contains \"%@\"" = "Chọn thư mục mà nó chứa \"%@\"";
"Extraction of \"%@\" failed" = "Giải nén cho \"%@\" thất bại";
"Keka - %i on queue" = "Keka - %i trong hàng đợi";
"Keka can't create this %@ image" = "Keka không thể tạo ra %@ ảnh đĩa";
"You can only create %@ images with a single folder. Try to put all your files in a folder and drop it to Keka to create the %@ image." = "Bạn chỉ có thể tạo %@ ảnh đĩa với một thư mục đơn lẻ. Hãy thử đưa tất cả tập tin vào một thư mục rồi kéo thả vào Keka để tạo ra %@ ảnh đĩa.";
"Keka can't create this @% tarball" = "Keka không thể tạo ra @% tarball";
"This operation is not supported on %@." = "Thao tác này không hỗ trợ trên %@.";
"Compress \"%@\" in %@ to..." = "Nén \"%@\" trong %@ đến...";
"Compress in %@ to..." = "Nén trong %@ đến...";
"Save as:" = "Lưu như:";
"Compress" = "Nén";
"Extract \"%@\" to..." = "Giải nén \"%@\" đến…";
"Extract as:" = "Giải nén như:";
"Extract" = "Giải nén";
"About %i seconds" = "Khoảng %i giây";
"About %i minutes" = "Khoảng %i phút";
"About %i hours" = "Khoảng %i tiếng";
"About %i days" = "Khoảng %i ngày";
"About %i weeks" = "Khoảng %i tuần";
"About %i months" = "Khoảng %i tháng";
"About %i years" = "Khoảng %i năm";
"About a minute" = "Khoảng 1 phút";
"About an hour" = "Khoảng 1 tiếng";
"About a day" = "Khoảng 1 ngày";
"About a week" = "Khoảng 1 tuần";
"About a month" = "Khoảng 1 tháng";
"About a year" = "Khoảng 1 năm";
"Finishing..." = "Finishing...";
"Can't show progress time..." = "Không thể hiện ra thời gian xử lý…";
"Password for \"%@\"" = "Mật khẩu cho \"%@\"";
"Format" = "Định dạng";
"Method" = "Mức độ nén";
"Method:" = "Loại nén:";
"No compression" = "Không nén";
"Fastest, less compression" = "Nhanh nhất, ít nén";
"Fast, less compression" = "Nhanh, ít nén";
"Normal" = "Bình thường";
"Slow, more compression" = "Chậm, nén nhiều";
"Slowest, more compression" = "Chậm nhất, nén nhiều";
"Compression" = "Nén";
"Extraction" = "Giải nén";
"Keka can't use the \"extlx.plist\" list, please get in contact with the developers.\n\nNow Keka will quit." = "Keka không thể sử dụng danh sách \"extlx.plist\", vui lòng liên hệ với bộ phận lập trình viên của Keka.\n\nKeka sẽ tự thoát ngay.";
"Keka is dying!" = "Keka đang chết dần!";
"Ask each time" = "Luôn hỏi mỗi lần";
"Next to original file" = "Bên cạnh tập tin gốc";
"Custom folder..." = "Thư mục tuỳ chỉnh...";
"Same as original file" = "Giống như tập tin gốc";
"Custom name..." = "Tên tuỳ chỉnh...";
"Archive" = "Lưu trữ";
"Set as default folder" = "Đặt làm thư mục mặc định";
"Perform automatic action" = "Thực hiện thao tác tự động";
"Always compress" = "Luôn luôn nén";
"Always extract" = "Luôn luôn giải nén";
"1.4 MB Floppy" = "Đĩa mềm 1.4 MB";
"650 MB CD" = "650 MB CD";
"700 MB CD" = "700 MB CD";
"4.7 GB DVD" = "4.7 GB DVD";
"Drop here to extract" = "Thả vào đây để giải nén";
"Drop here to compress" = "Thả vào đây để nén";
"Binary \"%@\" is not accessible" = "Tập nhị phân \"%@\" không thể truy cập";
"The first part \"%@\" can't be found" = "Phần đầu tiên của \"%@\" bị thất lạc";
"Unable to extract a folder" = "Không thể giải nén một thư mục";
"unknown" = "không biết";
"Unknown error" = "Lỗi không xác định";
"Error code %d using \"%@\"\n%@" = "Mã lỗi %d sử dụng \"%@\"\n%@";
"Keka was unable to create the extraction package" = "Keka không thể tạo ra gói giải nén";
"No errors found" = "Không tìm thấy lỗi";
"Minor error, the operation may be done well" = "Có lỗi nhỏ, thao tác có thể đã hoàn thành";
"Fatal error" = "Lỗi nghiêm trọng";
"CRC error occurred, maybe the file is corrupt" = "Đã xảy ra lỗi CRC, có thể tập tin đã bị hỏng";
"Attempt to modify an archive previously locked" = "Đang cố gắng chỉnh sửa một tập tin nén đã được khoá từ trước";
"Maybe you don't have permission to write or your disk is full" = "Có thể bạn không có quyền truy cập để ghi dữ liệu hoặc ổ đĩa của bạn đã đầy";
"Can't open the file, maybe you don't have read permission" = "Không thể mở tập tin, có thể bạn không có quyền truy cập để đọc dữ liệu";
"Command line error, please contact with the developer" = "Lỗi câu lệnh, vui lòng liên hệ với nhà phát triển";
"Not enough memory. Try to close some programs and repeat the operation" = "Không đủ bộ nhớ tạm. Hãy thử đóng bớt một vài chương trình và thực hiện lại thao tác";
"Can't create the file, maybe you don't have permission or free space" = "Không thể tạo tập tin, có thể bạn không có quyền truy cập hoặc không còn dung lượng trống";
"Canceled manually" = "Đã huỷ bỏ theo yêu cầu";
"Bad password, try again" = "Mật khẩu không đúng, vui lòng thử lại";
"This archive is locked" = "Tập tin này đã được khoá";
"Write error. No permission? No space left?" = "Lỗi ghi dữ liệu. Không có quyền truy cập? Không còn chỗ trống?";
"Can't open the file, maybe it's not accessible" = "Không thể mở tập tin, có thể tập tin không truy cập được";
"No files matching the mask" = "Không có tập tin phù hợp với đánh dấu";
"There were some read errors" = "Xuất hiện lỗi đọc dữ liệu";
"Give access" = "Cho phép truy cập";
"Just folder access" = "Chỉ truy cập thư mục";
"Quit" = "Thoát";
"More information" = "Thông tin bổ sung";
"Keka needs file access" = "Keka cần quyền truy cập tập tin";
"Give home access" = "Cho phép truy cập thư mục home";
"Customize" = "Tuỳ chỉnh";
"Keka needs access to the source file/s." = "Keka cần quyền truy cập vào các tập tin nguồn.";
"In order to work seamlessly with your files, Keka needs local access to the Mac disk." = "Để hoạt động mượt mà với tập tin của bạn, Keka cần quyền truy cập nội bộ vào ổ đĩa Mac.";
"\nSimply click on \"Give access to Keka\", your disk should already be selected." = "\nChỉ cần nhấp chuột vào \"Give access to Keka\", ổ đĩa của bạn sẽ được chọn sẵn.";
"Give access to Keka" = "Cho Keka quyền truy cập";
"Full Mac access (Recommended)" = "Quyền truy cập đầy đủ cho Mac (Khuyên dùng)";
"Home folder access" = "Truy cập thư mục Home";
"External volumes access" = "Truy cập ổ đĩa ngoài";
"Full Mac" = "Toàn bộ Mac";
"Home folder" = "Thư mục Home";
"External volumes" = "Ỗ đĩa gắn ngoài";
"Show in context menu" = "Hiện trong menu ngữ cảnh";
"External disk: %@" = "Ổ đĩa ngoài: %@";
"An extension is required" = "Yêu cầu một phần mở rộng";
"In order to set Keka as the default application, you need to install an extension. Click on \"More information\" to follow the required steps.\n\nRemember that you can always set Keka as the default application for any format using the Finder's \"Get Info\" panel." = "Để đặt Keka làm ứng dụng giải nén mặc định, bạn cần cài đặt phần mở rộng. Hãy vào mục \"More information\" và làm theo hướng dẫn.\n\nHãy nhớ rằng bạn có thể đặt Keka làm ứng dụng mặt định cho bất kỳ định dạng nào bằng cách sử dụng lệnh \"Get Info\" của Finder.";
"Your installed extension is obsolete and you should update it." = "Tiện ích mở rộng đã cài đặt của bạn đã lỗi thời và bạn nên cập nhật nó.";
"Update" = "Cập nhật";
"Cannot set Keka as default" = "Không để đặt Keka làm mặc định";
"The intermediate application failed to launch. There is more information in the Console.app." = "Không thể khởi chạy ứng dụng trung gian. Thông tin chi tiết được trình bày trong Console.app.";
"The intermediate application returned an undefined code." = "Ứng dụng trung gian trả về một mã lệnh chưa xác định.";
"Keka is now set as the default application for its known formats." = "Keka đã được đặt làm ứng dụng mặc định cho định dạng mà nó hỗ trợ.";
"Keka set as default" = "Keka đã đặt làm mặc định";
"There were some errors while registering the formats. There is more information in the Console.app." = "Xuất hiện lỗi trong lúc đăng ký định dạng. Thông tin chi tiết trình bày trong Console.app.";
"The intermediate application can't get access to Keka." = "Ứng dụng trung gian không thể truy cập đến Keka.";
"The intermediate application can't find Keka." = "Ứng dụng trung gian không tìm thấy Keka.";
"Show in Finder" = "Hiện trong Finder";
"Delete" = "Xoá";
"Continue without encryption" = "Tiếp tục mà không cần mã hoá";
"The password does not match" = "Mật khẩu không trùng khớp";
"The password is not properly set and the file cannot be encrypted. You can cancel and set the password again or continue the process without encryption." = "Mật khẩu không được đặt đúng và không thể mã hóa tệp. Bạn có thể hủy và đặt lại mật khẩu hoặc tiếp tục quá trình mà không cần mã hóa.";
"Use legacy encryption" = "Sử dụng mã hoá truyền thống";
"Using AES-256 encryption in ZIP" = "Sử dụng mã hoá AES-256 cho ZIP";
"Note that most modern operating systems such as macOS (before macOS 11.0 Big Sur) or Windows do not support AES-256 encrypted ZIPs by default.\n\nYou can open those files easily with most third party extraction utilities." = "Lưu ý rằng hầu hết các hệ điều hành hiện nay như macOS (trước bản macOS 11.0 Big Sur) hay Windows không hỗ trợ mã hoá AES-256 cho ZIPs mặc định.\n\nBạn vẫn có thể mở các tập tin này dễ dàng bằng phần mềm giải nén thứ ba.";
"Cannot create the file" = "Không thể tạo tệp";
"Keka has no file access to the source file/s\nGive it access when asked or manually in the Preferences" = "Keka không có quyền truy cập vào các tập tin nguồn\nCấp quyền truy cập cho nó khi được hỏi hoặc tuỳ chỉnh thủ công trong mục Cài đặt";
"Give access to the source/s folder/s" = "Cấp quyền truy cập đến các thư mục nguồn";
"Give access to the compressed file" = "Cấp quyền truy cập đến các tập tin đã nén";
"The extension is enabled" = "Phần mở rộng đã bật";
"The extension is disabled" = "Phần mở rộng đã tắt";
"Enable or disable the extension" = "Bật hoặc tắt phần mở rộng";
"Keka will decide whether to compress or uncompress based on file format and extension. This is the recommended option." = "Keka sẽ quyết định nén hay giải nén dựa trên định dạng và phần mở rộng của tệp. Đây là tùy chọn được đề nghị.";
"Keka will compress all files, even those that are already compressed. You can compress an already compressed file in automatic mode by dropping it to the bottom part of the drop zone." = "Keka sẽ nén tất cả các tệp, ngay cả những tệp đã được nén. Bạn có thể nén một tệp đã được nén ở chế độ tự động bằng cách thả nó xuống phần dưới cùng của vùng thả.";
"Keka will try to extract all files. You can try to extract an unknown file in automatic mode by dropping it in the bottom part of the drop zone." = "Keka sẽ cố gắng giải nén tất cả các tệp. Bạn có thể cố gắng giải nén một tệp không xác định ở chế độ tự động bằng cách thả nó vào phần dưới cùng của vùng thả.";
"Show the operation log" = "Hiện nhận ký hoạt động";
"Unable to process tips" = "Không thể xử lý tiền ủng hộ";
"Already tipping a monthly %@" = "Đã gửi tiền ủng hộ hàng tháng %@";
"Send a monthly %@ tip" = "Gửi một chút %@ tiền ủng hộ hàng tháng";
"Send a %@ tip" = "Gửi một ít %@ tiền ủng hộ";
"Give Keka some love ♥" = "Gửi Keka một chút tình yêu ♥";
"All extractions will be expanded at this location." = "Tất cả các nội dung giải nén sẽ được mở rộng tại vị trí này.";
"All compressions will be stored at this location." = "Tất cả tập tin nén sẽ được lưu trữ tại vị trí này.";
"You'll be asked where to extract each operation." = "Bạn sẽ được hỏi nơi lưu nội dung giải nén mỗi khi bắt đầu.";
"You'll be asked where to compress each operation." = "Bạn sẽ được hỏi nơi lưu tập tin nén mỗi khi bắt đầu.";
"If Keka has File Access it will execute the operation near the source file/s, otherwise it will ask for a location. You can set Keka's File Access in the Preferences tab so this option works properly." = "Nếu Keka có Quyền truy cập tập tin nó sẽ thực hiện tác vụ gần cạnh vị trí lưu tập tin nguồn, ngược lại nó sẽ hỏi một vị trí để lưu. Bạn có thể thiết đặt Quyền truy cập tập tin của Keka trong Cài đặt để tính năng này hoạt động bình thường.";
"Keka has no file access to the destination folder so it needs to ask for a location.\nYou can add access to this and other folders in Keka's Preferences File Access pane." = "Keka không có quyền truy cập tệp vào thư mục đích nên cần phải hỏi một vị trí lưu khác.\nBạn có thể thêm quyền truy cập vào thư mục này và nhiều thư mục khác trong Cài đặt, mục Quyền truy cập tập tin của Keka";
"The characters %@ are not compatible with the %@ format" = "Các ký tự %@ không tương thích với định dạng %@";
"The character %@ is not compatible with the %@ format" = "Ký tự %@ không tương thích với định dạng %@";
"Stop compressing" = "Stop compressing";
"Stop extracting" = "Stop extracting";
"Resume compressing" = "Resume compressing";
"Resume extracting" = "Resume extracting";
"Pause compressing" = "Pause compressing";
"Pause extracting" = "Pause extracting";
"Compression paused" = "Compression paused";
"Extraction paused" = "Extraction paused";
"Waiting for password" = "Waiting for password";
"On queue" = "On queue";
"Applying quarantine..." = "Applying quarantine...";

/*
// MAS tips
// Note this will be used in Apple's servers
// Apple needs to have MAS translated in this language so this strings can be used
// The language used in MAS/AppleID will be used in Keka's tip strings and may not match Keka's localization
// Note that the short string is limited to 30 characters and the long string is limited to 45 characters
// Emojis cannot be used in these strings :(
*/
"Monthly sip of coffee" = "Chút cà phê mỗi tháng";
"Gift Keka a sip of coffee each month" = "Gửi Keka một chút cà phê mỗi tháng";
"Monthly coffee" = "Ly cà phê mỗi tháng";
"Gift Keka a coffee each month" = "Gửi Keka một ly cà phê mỗi tháng";
"Monthly pair of coffees" = "Gói cà phê mỗi tháng";
"Gift Keka a couple coffees each month" = "Gửi Keka cả một gói cà phê mỗi tháng";
"Monthly breakfast" = "Bữa ăn sáng mỗi tháng";
"Gift Keka a breakfast each month" = "Gửi Keka một bữa ăn sáng mỗi tháng";
"Tip a coffee" = "Ủng hộ cà phê";
"Tip Keka a coffee so it can stay awake" = "Gửi Keka một chút cà phê để nó cày đêm";
"Tip a breakfast" = "Ủng hộ bữa sáng";
"Tip Keka a breakfast so it can start fresh" = "Gửi Keka một bữa sáng để nó khởi động mượt mà";
"Tip a lunch" = "Ủng hộ bữa trưa";
"Tip Keka a lunch and feed it" = "Gửi Keka một bữa trưa thật no";
"Tip a dinner" = "Ủng hộ bữa tối";
"Tip Keka a dinner so it keeps rolling" = "Gửi Keka một bữa tối để nó tiếp tục quay vòng";
"Tip a bunch of food" = "Ủng hộ nhiều thức ăn hơn";
"Tip Keka a new bunch of food to keep rolling" = "Gửi Keka một đống đồ ăn để giữ nó quay vòng";
